backend/app/controllers/practice_sessions_controller.rb

  def index
    @practice_sessions = PracticeSession.all
---
SELECT "practice_sessions".* FROM "practice_sessions"